{
  "main": {
    "name":"Ibrahim Said",
    "description":"Designer, Developer, and Engineer",
    "image":"logo.png",
    "bio":"Hardworking, self-motivated engineer with an organized approach to meeting multiple, concurrent deadlines. Ample experience developing web applications, front and back-end. I enjoy designing embedded systems and stay up to date with microcontroller tech. Beyond that I am cryptocurrency enthusiast and basketball fanatic.",
    "contactmessage":"Want to hire me? Have a project you need help with? Feel free to contact at any of the avenues below.",
    "email": "ibrahim.said95@gmail.com",
    "phone": "647-779-4369",
    "projects":"https://projects.ibrahimsaid.ca",
    "github":"https://github.com/1brahimsaid",
    "address":{
      "city":"Toronto",
      "state":"Ontario"
    },
    "website": "https://www.ibrahimsaid.ca/",
    "resumedownload":"https://www.projects.ibrahimsaid.ca/resume",
    "social":[
      {
        "name":"email",
        "url":"mailto:ibrahim.said95@gmail.com",
        "className":"fa fa-envelope-o"
      },
      {
        "name":"linkedin",
        "url":"https://www.surpassyourgoals.com/wp-content/uploads/stop_sign_custom_19525.png",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/1brahimsaid",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Adept in several programming languages with a decent skill base in others. I learn and adapt quickly in both team and self-directed settings.",
    "education":[
      {
        "school":"Bachelor of Engineering",
        "degree":"Biomedical & Electrical",
        "image":"07.png",
        "graduated":"5/2021",
        "description":"Carleton Capital Scholoarship Winner. Hack the Wall 2020 First Place. It was here I achieved a thorough understanding of the underlying theory and concepts behind biotechnology, signal processing, and image analysis. While at Carleton University I discovered my passion for data collection and statistics."
      }
    ],
    "work":[
      {
        "company":"Fantom Digital",
        "title":"Co-founder & Lead Developer",
        "image":"08.png",
        "years":"5/2021 - Present",
        "description":"Designed and built web applications to facilitate the sale of company created digital commodities. Oversee products that exceed US$1,000,000 in revenue and maintain 2,000 users globally. Handle all aspects of Fantom Digital's business development, strategic growth, and marketing. Maintain several high traffic websites and backends, generating revenue monthly."
      },
      {
        "company":"Bill Gosling Outsourcing",
        "title":"Compliance Engineer",
        "image":"09.png",
        "years":"8/2019 - 1/2020",
        "description":"Executed regular security audits to mitigate risk to clients like Capital One and Freedom. Tested and reviewed workstations for vulnerabilities, patching threats as necessary. Performed daily compliance monitoring of company and employee internal communications."
      },
      {
        "company":"Honda of Canada Manufacturing",
        "title":"Quality Engineer",
        "image":"10.png",
        "years":"1/2018 - 1/2019",
        "description":"Restructured the quality assurance and production process of the Honda CRV. Trained line workers to identify and remediate common production errors. Created training manuals and visual aids to streamline inspection processes."
      },
      {
        "company":"Sensbomb",
        "title":"Co-founder",
        "image":"11.png",
        "years":"4/2016 - 11/2018",
        "description":"Co-founded a health and beauty start-up company, specializing in bath bombs and soap. Exceeded US$350,000 in revenue and sold products to over 10,000 customers, sold the company. Developed and operated supply chains in the US, Canada, and UK."
      }
    ],
    "additional":[
      {
        "company":"FTM Alerts",
        "title":"Content Specialist",
        "image":"12.png",
        "years":"5/2021 - Present",
        "description":"Grew the online brand FTM Alerts through engagement, outreach, and marketing. Gained 120,000 followers (+521% YTD) educating users on financial strategies and investment. Organized and conducted live interviews with businesses, providing exposure and marketing."
      },
      {
        "company":"24 Consulting",
        "title":"Lead Consultant",
        "image":"13.png",
        "years":"8/2021 - Present",
        "description":"Assisted start-ups with treasury management, strategy development, and investment structure. Improved client profit retention with cost-benefit analysis and allocation restructuring. Created comprehensive risk management strategies to mitigate market risk for clients."
      },
      {
        "company":"Centre for Student Academic Support",
        "title":"Peer Assisted Study Sessions Facilitator",
        "image":"07.png",
        "years":"1/2019 - 4/2019",
        "description":"Led weekly workshops providing students with additional coursework and assistance. Designed workshops, mock exams, and led revision sessions on graded content. Provided comprehensive academic support face to face, over email, and in a class setting"
      }
    ],
    "skills":[
      {
        "name":"C++",
        "description":"This is my first programming language and the one I am most comfortable with. Experience dealing with dynamic data structures and lists.",
        "image":"01.png",
        "level":"96%"
      },
      {
        "name":"Photoshop",
        "description":"A skill I have built up over the years. UI Design, Animations, or Graphic Design. Show me your vision and I will make it a reality!",
        "image":"02.png",
        "level":"100%"
      },
      {
        "name":"x86 Assembly",
        "description":"A more recent addition to my skill list. I have practice writing developing with the i386/8086 microprocessors. Programmed an Escape game in MASM.",
        "image":"03.png",
        "level":"88%"
      },
      {
        "name":"Verilog HDL",
        "description":"The primary language I use to develop on FPGAs and other ICs. Created several innovative tools with the use of finite state machines, encoders, registers and logic.",
        "image":"04.png",
        "level":"80%"
      },
      {
        "name":"MATLAB",
        "description":"My go-to numeric computing platform, I use MATLAB on a daily basis for a variety of reasons. Signal processing, image analysis, simulation, neural networks and so much more. I do most extensive iterative work here.",
        "image":"05.png",
        "level":"95%"
      },
      {
        "name":"Javascript",
        "description":"What can I say, the site you are looking at was created with React JS. I use javascript primarily for web development. Only language I use daily.",
        "image":"06.png",
        "level":"95%"
      },
      {
        "name":"ARM Assembly",
        "description":"Similar to x86 but instead with RISC (Reduced Instruction Set Computer). ARM-based Microprocessors come natural for me. Primary experience is with the ARM mbed Application Shield (Cortex-M0).",
        "image":"07.png",
        "level":"91%"
      },
      {
        "name":"OrCAD",
        "description":"Experience designing and implementing analog circuits with verification. Used OrCad as a way to theoretically test electronics/circuits prior to real assembly, due to Covid-19 restrictions.",
        "image":"08.png",
        "level":"88%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Discuss.Fantom.Digital",
        "category":"Community Forums with cryptocurrency payments facilitated by web3 and solidity. Created with React.js, Next.js, and TailwindCSS, this site facilitates crypto discussion around the Fantom Blockchain.",
        "image":"discuss.jpeg",
        "url":"https://projects.ibrahimsaid.ca/discuss"
      },
      {
        "title":"IMU Sports Monitor",
        "category":"Wearable IMU Sensor System that can reliably collect and store data for the assessment and improvement of sports performance. System can be fitted with complementary sensors to adapt to different activities and sports as needed.",
        "image":"01.jpg",
        "url":"https://projects.ibrahimsaid.ca/imudatalogger"
      },
      {
        "title":"Simulation Study: Manufacturing Facility",
        "category":"A simulation study conducted to assess the performance of a manufacturing facility based on historical data. The objective of the simulation was to identify the ideal behaviour/priority of the entities involved.",
        "image":"system.jpeg",
        "url":"https://projects.ibrahimsaid.ca/simulationstudy"
      },
      {
        "title":"Egg Timer FPGA Design",
        "category":"Verilog (HDL) code combining counters, finite state machines, encoders, registers and logic to build a custom FPGA based Egg Timer. Additional features like stopwatch and alarm.",
        "image":"eggtimer.png",
        "url":"https://projects.ibrahimsaid.ca/eggtimer"
      },
      {
        "title":"Chonker x86 Assembly Game",
        "category":"A fun game I created using x86 Assembly Language. This game was created using hardware and software interrupts to directly respond to events",
        "image":"02.jpg",
        "url":"https://projects.ibrahimsaid.ca/chonker"
      },
      {
        "title":"Flappy Bird with EMG-Controlled Mouse",
        "category":"Created a safe and isolated system to play Flappy Bird with a forearm muscle twitch. Modified a computer mouse so that its left button is operated by the electromyographic (EMG) signal. ",
        "image":"03.jpg",
        "url":"https://projects.ibrahimsaid.ca/flappybird"
      },
      {
        "title":"Simple DC Motor",
        "category":"A set of instructions to create a simple DC motor with just a ceramic magnet, paperclip, screws, 9v battery, copper wire and electrical wire.",
        "image":"04.jpg",
        "url":"https://projects.ibrahimsaid.ca/simpledcmotor"
      }
    ]
  }
}
