{
  "main": {
    "name":"Ibrahim Said",
    "description":"Programmer, Graphic Designer, Developer, and Future P.Eng",
    "image":"profilepic.jpg",
    "bio":"I am a self-motivated, passionate, hardworking coder with an organized approach to meeting multiple, concurrent deadlines. I have experience developing systems and testing scripts in numerous languages. Beyond that I am cryptocurrency enthusiast, basketball fanatic, and video game lover. Constantly adding and tweaking my computer builds, generating content, and loving life!",
    "contactmessage":"Want to hire me? Have a project you need help with? Want to just chat? Feel free to contact me below, and  allow two business days for a response. For the most prompt reply use email! And as always have a wonderful day!",
    "email": "ibrahim.said95@gmail.com",
    "phone": "647-779-4369",
    "projects":"https://projects.ibrahimsaid.ca",
    "github":"https://github.com/1brahimsaid",
    "address":{
      "city":"Ottawa",
      "state":"Ontario"
    },
    "website": "https://www.ibrahimsaid.ca/",
    "resumedownload":"https://www.ibrahimsaid.ca/resume.pdf",
    "social":[
      {
        "name":"email",
        "url":"mailto:ibrahim.said95@gmail.com",
        "className":"fa fa-envelope-o"
      },
      {
        "name":"linkedin",
        "url":"https://www.surpassyourgoals.com/wp-content/uploads/stop_sign_custom_19525.png",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/1brahimsaid",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"I am fluent in several programming languages, with good experience in others. I learn and master new languages quickly in both team and self-directed settings. Comfortable handling multiple projects simultaneously with little to no supervision.",
    "education":[
      {
        "school":"Carleton University",
        "degree":"Biomedical & Electrical Engineering (B. Eng)",
        "image":"07.png",
        "graduated":"April 2021",
        "description":"I studied Biomedical & Electrical Engineering at Carleton University. It was here I achieved a thorough understanding of the underlying theory and concepts behind programming, biotechnology, signal processing, and image analysis. While at Carleton University I discovered my passion for data collection, statistics, and analytic work."
      }
    ],
    "work":[
      {
        "company":"Bill Gosling Outsourcing",
        "title":"Commercial Credit Analyist",
        "image":"09.png",
        "years":"July 2019 - January 2020",
        "description":" I worked to control potential client exposure with order management strategies designed to minimize credit risk and generate revenue. My work was outsourced to the client bases of several institutions including Capital One, Freedom Mobile, and Costco. I broke down and evaluated client problems, using tests, personal expertise and probing questions. It was here I conducted the financial review of assets for the purposes of settlement, closure, and payment."
      }
    ],
    "skills":[
      {
        "name":"C++",
        "description":"Whether typing Arduino or just general C++ work, this is my first language and probably the one I am most comfortable in. Experience dealing with dynamic data structures and lists.",
        "image":"01.png",
        "level":"95%"
      },
      {
        "name":"Photoshop",
        "description":"A skill I have built up over the years. UI Design, Animations, Graphic Design, anything you need I got it. If you need design work done I am your man!",
        "image":"02.png",
        "level":"100%"
      },
      {
        "name":"x86 Assembly",
        "description":"A more recent addition to my skill list w/ ARM aswell. I have experience writing Assembly for the i386 and 8086 microprocessors. Created an Escape game in MASM.",
        "image":"03.png",
        "level":"88%"
      },
      {
        "name":"Verilog HDL",
        "description":"The primary language I use when developing FPGAs or other ICs. Made an Egg Timer with the use of finite state machines, encoders, and logic. Adding more experience here as time passes.",
        "image":"04.png",
        "level":"80%"
      },
      {
        "name":"MATLAB",
        "description":"My go-to programming and numeric computing platform, I use MATLAB almost on a daily basis for a variety of reasons. Signal processing, image analysis, simulation, neural networks and so much else. I do most iterative work here.",
        "image":"05.png",
        "level":"95%"
      },
      {
        "name":"Javascript",
        "description":"What can I say, the site you are looking at was created with React.js and Node.js. I use javascript primarily for web development. But, I am always looking for ways to expand this.",
        "image":"06.png",
        "level":"86%"
      },
      {
        "name":"ARM Assembly",
        "description":"Very similar experience to x86 but with ARM-based microprocessors. Primary experience here is with the ARM mbed Application Shield (Cortex-M0). I believe ARM is the future and continue to learn more.",
        "image":"07.png",
        "level":"81%"
      },
      {
        "name":"OrCAD",
        "description":"Experience designing and implementing analog circuits with verification. Because of covid, this was the only way I could simulate and theoretically test electronics for characteristics and properties.",
        "image":"08.png",
        "level":"88%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Discuss.Fantom.Digital",
        "category":"Community Forums with cryptocurrency payments facilitated by web3 and solidity. Created with React.js, Next.js, and TailwindCSS, this site facilitates crypto discussion around the Fantom Blockchain.",
        "image":"discuss.jpeg",
        "url":"https://projects.ibrahimsaid.ca/discuss"
      },
      {
        "title":"IMU Sports Monitor",
        "category":"Wearable IMU Sensor System that can reliably collect and store data for the assessment and improvement of sports performance. System can be fitted with complementary sensors to adapt to different activities and sports as needed.",
        "image":"01.jpg",
        "url":"https://projects.ibrahimsaid.ca/imudatalogger"
      },
      {
        "title":"Simulation Study: Manufacturing Facility",
        "category":"A simulation study conducted to assess the performance of a manufacturing facility based on historical data. The objective of the simulation was to identify the ideal behaviour/priority of the entities involved.",
        "image":"system.jpeg",
        "url":"https://projects.ibrahimsaid.ca/simulationstudy"
      },
      {
        "title":"Egg Timer FPGA Design",
        "category":"Verilog (HDL) code combining counters, finite state machines, encoders, registers and logic to build a custom FPGA based Egg Timer. Additional features like stopwatch and alarm.",
        "image":"eggtimer.png",
        "url":"https://projects.ibrahimsaid.ca/eggtimer"
      },
      {
        "title":"Chonker x86 Assembly Game",
        "category":"A fun game I created using x86 Assembly Language. This game was created using hardware and software interrupts to directly respond to events",
        "image":"02.jpg",
        "url":"https://projects.ibrahimsaid.ca/chonker"
      },
      {
        "title":"Flappy Bird with EMG-Controlled Mouse",
        "category":"Created a safe and isolated system to play Flappy Bird with a forearm muscle twitch. Modified a computer mouse so that its left button is operated by the electromyographic (EMG) signal. ",
        "image":"03.jpg",
        "url":"https://projects.ibrahimsaid.ca/flappybird"
      },
      {
        "title":"Simple DC Motor",
        "category":"A set of instructions to create a simple DC motor with just a ceramic magnet, paperclip, screws, 9v battery, copper wire and electrical wire.",
        "image":"04.jpg",
        "url":"https://projects.ibrahimsaid.ca/simpledcmotor"
      }
    ]
  }
}
